package quest1;

public class normal {
    public static void main(String[] args) {
//        Объявите 10 переменных типа int со значениями 0,1, 2, 3, 4, 5, 6, 7, 8, 9.
//        Объявите ещё одну переменную int и сохраните в неё сумму этих переменных, деленную на 10.
//        Получается, у вас будет среднее арифметическое этих чисел в одной переменной.
//                Распечатайте её через println.
//                Сколько программа отбросила в дробной части?
//                Исправьте код, чтобы среднее арифметическое вычислялось правильно.

        int a = 0;
        int b = 1;
        int c = 2;
        int d = 3;
        int e = 4;
        int f = 5;
        int g = 6;
        int h = 7;
        int x = 8;
        int t = 9;

        double z = (a + b + c + d + e + f + g + h + x + t) / 10;
        System.out.println(z);

    }
}
